# Напишите программу, в которой пользователь будет задавать две строки,
# а программа - определять количество вхождений одной строки в другой.
# Пример
# -Для "abababb" и "aba" -> 2


S = 'abababb'
print(S.rfind('aba'))



